; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph1 - mode
	infrared0 - mode
	infrared2 - mode
	image3 - mode
	Star8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star13 - direction
	Star14 - direction
	GroundStation15 - direction
	GroundStation21 - direction
	GroundStation16 - direction
	GroundStation0 - direction
	Star5 - direction
	Star23 - direction
	Star6 - direction
	GroundStation22 - direction
	GroundStation11 - direction
	Star17 - direction
	GroundStation7 - direction
	Star12 - direction
	Star24 - direction
	GroundStation18 - direction
	Star20 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star19 - direction
	Star2 - direction
	Phenomenon25 - direction
	Star26 - direction
	Star27 - direction
	Planet28 - direction
	Star29 - direction
	Phenomenon30 - direction
	Phenomenon31 - direction
	Planet32 - direction
	Phenomenon33 - direction
	Planet34 - direction
	Phenomenon35 - direction
	Star36 - direction
	Phenomenon37 - direction
	Phenomenon38 - direction
	Star39 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation16)
	(supports instrument1 infrared2)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation11)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(supports instrument2 image3)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation10)
	(supports instrument3 infrared2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star19)
	(calibration_target instrument3 GroundStation22)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star23)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star24)
	(supports instrument4 image3)
	(supports instrument4 infrared0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 Star20)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star17)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star20)
	(calibration_target instrument5 GroundStation18)
	(calibration_target instrument5 Star24)
	(supports instrument6 spectrograph1)
	(supports instrument6 image3)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star19)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation18)
)
(:goal (and
	(pointing satellite0 Star13)
	(have_image Phenomenon25 spectrograph1)
	(have_image Star26 spectrograph1)
	(have_image Star27 infrared0)
	(have_image Planet28 spectrograph1)
	(have_image Star29 infrared0)
	(have_image Phenomenon30 infrared0)
	(have_image Phenomenon31 spectrograph1)
	(have_image Planet32 infrared2)
	(have_image Phenomenon33 infrared2)
	(have_image Planet34 infrared0)
	(have_image Phenomenon35 infrared0)
	(have_image Star36 infrared0)
	(have_image Phenomenon37 infrared2)
	(have_image Phenomenon38 infrared0)
	(have_image Star39 image3)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 16
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 16
3. (turn_to satellite2 phenomenon30 groundstation18)
   deleted: (pointing satellite2 groundstation18)
   added: (pointing satellite2 phenomenon30)
   goals met: 0 of 16
4. (turn_to satellite0 phenomenon25 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon25)
   goals met: 0 of 16
5. (turn_to satellite2 star20 phenomenon30)
   deleted: (pointing satellite2 phenomenon30)
   added: (pointing satellite2 star20)
   goals met: 0 of 16
6. (calibrate satellite2 instrument4 star20)
   added: (calibrated instrument4)
   goals met: 0 of 16
7. (turn_to satellite2 phenomenon30 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 phenomenon30)
   goals met: 0 of 16
8. (take_image satellite2 phenomenon30 instrument4 infrared0)
   added: (have_image phenomenon30 infrared0)
   goals met: 1 of 16
9. (turn_to satellite2 phenomenon33 phenomenon30)
   deleted: (pointing satellite2 phenomenon30)
   added: (pointing satellite2 phenomenon33)
   goals met: 1 of 16
10. (take_image satellite2 phenomenon33 instrument4 infrared2)
   added: (have_image phenomenon33 infrared2)
   goals met: 2 of 16
11. (turn_to satellite2 phenomenon35 phenomenon33)
   deleted: (pointing satellite2 phenomenon33)
   added: (pointing satellite2 phenomenon35)
   goals met: 2 of 16
12. (take_image satellite2 phenomenon35 instrument4 infrared0)
   added: (have_image phenomenon35 infrared0)
   goals met: 3 of 16
13. (turn_to satellite2 phenomenon37 phenomenon35)
   deleted: (pointing satellite2 phenomenon35)
   added: (pointing satellite2 phenomenon37)
   goals met: 3 of 16
14. (take_image satellite2 phenomenon37 instrument4 infrared2)
   added: (have_image phenomenon37 infrared2)
   goals met: 4 of 16
15. (turn_to satellite2 phenomenon38 phenomenon37)
   deleted: (pointing satellite2 phenomenon37)
   added: (pointing satellite2 phenomenon38)
   goals met: 4 of 16
16. (take_image satellite2 phenomenon38 instrument4 infrared0)
   added: (have_image phenomenon38 infrared0)
   goals met: 5 of 16
17. (turn_to satellite2 planet32 phenomenon38)
   deleted: (pointing satellite2 phenomenon38)
   added: (pointing satellite2 planet32)
   goals met: 5 of 16
18. (take_image satellite2 planet32 instrument4 infrared2)
   added: (have_image planet32 infrared2)
   goals met: 6 of 16
19. (turn_to satellite2 planet34 planet32)
   deleted: (pointing satellite2 planet32)
   added: (pointing satellite2 planet34)
   goals met: 6 of 16
20. (take_image satellite2 planet34 instrument4 infrared0)
   added: (have_image planet34 infrared0)
   goals met: 7 of 16
21. (turn_to satellite2 star27 planet34)
   deleted: (pointing satellite2 planet34)
   added: (pointing satellite2 star27)
   goals met: 7 of 16
22. (take_image satellite2 star27 instrument4 infrared0)
   added: (have_image star27 infrared0)
   goals met: 8 of 16
23. (turn_to satellite2 star29 star27)
   deleted: (pointing satellite2 star27)
   added: (pointing satellite2 star29)
   goals met: 8 of 16
24. (take_image satellite2 star29 instrument4 infrared0)
   added: (have_image star29 infrared0)
   goals met: 9 of 16
25. (turn_to satellite2 star36 star29)
   deleted: (pointing satellite2 star29)
   added: (pointing satellite2 star36)
   goals met: 9 of 16
26. (take_image satellite2 star36 instrument4 infrared0)
   added: (have_image star36 infrared0)
   goals met: 10 of 16
27. (turn_to satellite2 star39 star36)
   deleted: (pointing satellite2 star36)
   added: (pointing satellite2 star39)
   goals met: 10 of 16
28. (take_image satellite2 star39 instrument4 image3)
   added: (have_image star39 image3)
   goals met: 11 of 16
29. (turn_to satellite0 star5 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 star5)
   goals met: 11 of 16
30. (calibrate satellite0 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 11 of 16
31. (turn_to satellite0 phenomenon25 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon25)
   goals met: 11 of 16
32. (take_image satellite0 phenomenon25 instrument2 spectrograph1)
   added: (have_image phenomenon25 spectrograph1)
   goals met: 12 of 16
33. (turn_to satellite0 phenomenon31 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon31)
   goals met: 12 of 16
34. (take_image satellite0 phenomenon31 instrument2 spectrograph1)
   added: (have_image phenomenon31 spectrograph1)
   goals met: 13 of 16
35. (turn_to satellite0 planet28 phenomenon31)
   deleted: (pointing satellite0 phenomenon31)
   added: (pointing satellite0 planet28)
   goals met: 13 of 16
36. (take_image satellite0 planet28 instrument2 spectrograph1)
   added: (have_image planet28 spectrograph1)
   goals met: 14 of 16
37. (turn_to satellite0 star13 planet28)
   deleted: (pointing satellite0 planet28)
   added: (pointing satellite0 star13)
   goals met: 15 of 16
38. (turn_to satellite0 star26 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star26)
   goals met: 14 of 16
39. (take_image satellite0 star26 instrument2 spectrograph1)
   added: (have_image star26 spectrograph1)
   goals met: 15 of 16
40. (turn_to satellite0 star13 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star13)
   goals met: 16 of 16
